module.ecs_service.data.aws_iam_policy_document.execution_assume_role: Reading...
module.vpc.aws_cloudwatch_log_group.flow_logs: Refreshing state... [id=/aws/vpc/flow-logs]
module.ecs_service.data.aws_iam_policy_document.task_assume_role: Reading...
module.vpc.aws_kms_key.vpc_flow_logs: Refreshing state... [id=347137e7-8489-4dd5-8ff0-561bac764438]
module.ecs_cluster.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:eu-west-1:456212641044:cluster/cerepx-dev-cluster]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-029a6cd1da94ed29e]
module.vpc.aws_iam_role.flow_logs_role: Refreshing state... [id=vpc-flow-logs-role]
module.rds.aws_kms_key.rds_performance_insights: Refreshing state... [id=c7a90af2-b80a-47f5-817d-76ef08929a64]
module.ecs_service.aws_cloudwatch_log_group.ecs_logs: Refreshing state... [id=/ecs/hello-birthday-api-service]
module.api_gateway.aws_apigatewayv2_api.api: Refreshing state... [id=fin2rd81o1]
module.ecs_service.data.aws_iam_policy_document.execution_assume_role: Read complete after 0s [id=1077804475]
module.ecs_service.data.aws_iam_policy_document.task_assume_role: Read complete after 0s [id=1077804475]
module.ecs_service.aws_iam_role.task_role: Refreshing state... [id=hello-birthday-api-service-task]
module.ecs_service.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=hello-birthday-api-service-exec]
module.ecs_service.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=hello-birthday-api-service-exec-20250428162643346700000002]
module.vpc.aws_iam_role_policy.flow_logs_policy: Refreshing state... [id=vpc-flow-logs-role:vpc-flow-logs-policy]
module.api_gateway.aws_apigatewayv2_stage.default_stage: Refreshing state... [id=$default]
module.vpc.aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/flowlogs/hello-birthday-dev]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-01c87601e22172550]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0116a9ef8764923a8]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-07832cfb87db1c4c3]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b4f96a4a08eb4a5b]
module.vpc.aws_security_group.ecs: Refreshing state... [id=sg-0ae81af3f721e51a4]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0b360bbebcaa480e5]
module.vpc.aws_security_group.vpc_endpoints: Refreshing state... [id=sg-021526ee9aacb5835]
module.vpc.aws_security_group.rds: Refreshing state... [id=sg-0622864b918d283ed]
module.vpc.aws_security_group.alb: Refreshing state... [id=sg-076af04a71628d30b]
module.alb.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/3407dc930bad48b6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ddb2b3fdf159574c]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0ca998b2f809f036c]
module.vpc.aws_flow_log.vpc_flow_logs: Refreshing state... [id=fl-0f0309c1f8f7d983e]
module.vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-061f4a5976790ac17]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bc26398f249d5dad]
module.vpc.aws_route.default_internet_access: Refreshing state... [id=r-rtb-0b360bbebcaa480e51080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-000b959cb9c8c17b6]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/985cc60b534ada89]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=hello-birthday-dev-subnet-group]
module.api_gateway.aws_apigatewayv2_vpc_link.api_vpc_link: Refreshing state... [id=ef4cpb]
module.vpc.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-00fcf997fa737e3ff]
module.vpc.aws_vpc_endpoint.cloudwatch_logs: Refreshing state... [id=vpce-0c74164063fcc63f1]
module.vpc.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-0a52f66d478624684]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08047ccfb754ab73d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f88590ccfac5c504]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:listener/app/hello-birthday-api-alb/985cc60b534ada89/9e3573c22ce1f6af]
module.rds.aws_db_instance.this: Refreshing state... [id=db-MNYKAUQQ3O3OCCMOP5A35SVKSM]
module.api_gateway.aws_apigatewayv2_integration.alb_integration: Refreshing state... [id=ycj81b2]
module.api_gateway.aws_apigatewayv2_route.default_route: Refreshing state... [id=77el2at]
module.ecs_service.aws_ecs_task_definition.this: Refreshing state... [id=hello-birthday-api-service]
module.ecs_service.aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:eu-west-1:456212641044:service/cerepx-dev-cluster/hello-birthday-api-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.alb.aws_lb.this has been deleted
  - resource "aws_lb" "this" {
      - arn                                                          = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/985cc60b534ada89" -> null
      - dns_name                                                     = "hello-birthday-api-alb-1207097031.eu-west-1.elb.amazonaws.com" -> null
        id                                                           = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/985cc60b534ada89"
        name                                                         = "hello-birthday-api-alb"
        tags                                                         = {}
      - zone_id                                                      = "Z32O12XQLNTSW2" -> null
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.alb.aws_lb_listener.http has been deleted
  - resource "aws_lb_listener" "http" {
      - arn                                                                 = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:listener/app/hello-birthday-api-alb/985cc60b534ada89/9e3573c22ce1f6af" -> null
        id                                                                  = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:listener/app/hello-birthday-api-alb/985cc60b534ada89/9e3573c22ce1f6af"
        tags                                                                = {}
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.alb.aws_lb_target_group.this has been deleted
  - resource "aws_lb_target_group" "this" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/3407dc930bad48b6" -> null
        id                                 = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/3407dc930bad48b6"
        name                               = "hello-birthday-api-tg"
        tags                               = {}
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.alb.aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "hello-birthday-api-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-076af04a71628d30b",
        ]
      + subnets                                                      = [
          + "subnet-0116a9ef8764923a8",
          + "subnet-0b4f96a4a08eb4a5b",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_target_group.this will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "hello-birthday-api-tg"
      + name_prefix                        = (known after apply)
      + port                               = 5000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-029a6cd1da94ed29e"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_integration.alb_integration will be updated in-place
  ~ resource "aws_apigatewayv2_integration" "alb_integration" {
        id                                        = "ycj81b2"
      ~ integration_uri                           = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:listener/app/hello-birthday-api-alb/985cc60b534ada89/9e3573c22ce1f6af" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.ecs_service.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:456212641044:service/cerepx-dev-cluster/hello-birthday-api-service"
        name                               = "hello-birthday-api-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:456212641044:task-definition/hello-birthday-api-service:12" -> "arn:aws:ecs:eu-west-1:456212641044:task-definition/hello-birthday-api-service:14"
        # (16 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "hello-birthday-api" -> null
          - container_port   = 5050 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/3407dc930bad48b6" -> null
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "hello-birthday-api"
          + container_port   = 5000
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

<!-- Sticky Pull Request Commentterraform-plan -->